thomsardi/stm32-lvd/src/main.cpp
#include <Arduino.h>
#include <CANController.h>
#include <STM32FreeRTOS.h>
#include <Beastdevices_INA3221.h>
#include <DataDef.h>
#include <BatteryProcessing.h>
#include <EEPROM.h>

#define ON1 PA5
#define ON2 PA6
#define ON3 PA7
#define OFF1 PB0
#define OFF2 PB1
#define OFF3 PB10

#define FB1 PB14
#define FB2 PB13
#define FB3 PB12

#define LVD_LOW_VSAT_ADDR 0
#define LVD_LOW_OTHER_ADDR 4
#define LVD_LOW_BTS_ADDR 8
#define LVD_RECONNECT_VSAT_ADDR 12
#define LVD_RECONNECT_OTHER_ADDR  16
#define LVD_RECONNECT_BTS_ADDR  20
#define LVD_TOLERANCE_ADDR 24
#define NOMINAL_BAT_ADDR 28
#define UNIQUE_ID_ADDR 32
#define FLAG_SET_ADDR 36

#define idCanbusEnergyMeter 0x1D40C8E7

CANController can;
Beastdevices_INA3221 ina3221b(INA3221_ADDR40_GND);
BatteryProcessing batProc;
AdditionalCANData additionalCanData;
AlarmParameter voltageAlarm = {4600, 4600, 4700, 4700, 4700, 4800};
TaskHandle_t relayTaskHandle;
TaskHandle_t canSenderTaskHandle;
// TaskHandle_t ina3221TaskHandle;

SemaphoreHandle_t myLock = xSemaphoreCreateMutex();

// QueueHandle_t relayTaskQueue;
QueueHandle_t canSenderTaskQueue;

uint32_t count;
uint32_t count2;
uint16_t uniqueId = 160;
uint8_t lostConnectionCounter = 0;
bool isOverriden;
unsigned long lastTime = 0;
unsigned long lastCheckTime = 0;

BatteryData batteryData[16];
size_t batterySize = sizeof(batteryData) / sizeof(batteryData[0]);

EhubRelayWrite ehubRelay;
KeepAliveCounter keepAliveCounter;
// put function declarations here:

void canHandler(CAN_msg_t msg)
{
  uint8_t data;
  bool state = true;
  count++;
  count2++;
  if (count > 9)
  {
    count = 0;
    // xQueueSend(relayTaskQueue, &data, 0);
    // xSemaphoreTake(myLock, 10);
  }
  if (count2 > 4)
  {
    count2 = 0;
    // xQueueSend(canSenderTaskQueue, &state, 0);
    // xSemaphoreTake(myLock, 10);
  }
  // Serial1.println("Count : " + String(count));
  // Serial1.print("ID : ");
  // Serial1.println(msg.id, HEX);

  // BatteryData *p;
  uint32_t frameId = msg.id;
  int length = msg.len;
  int index = 0;
  int baseAddr = 0;
  // Serial1.print("Frame Addr : ");
  // Serial1.println(frameId, HEX);
  // Serial1.println((frameId & 0xFFFFFFC0), HEX);
  switch (frameId & 0xFFFFFFC0)
  {
  case PACK_DATA:
    baseAddr = static_cast<int>(PACK_ADDR);
    index = baseAddr - frameId;
    // index = abs(index);
    // Serial1.println("index : " + String(index));
    // for (size_t i = 0; i < length; i++)
    // {
    //   Serial1.print(msg.data[i], HEX);
    //   Serial1.print(" ");
    // }
    batteryData[index - 1].isUpdated = 1;
    batteryData[index - 1].packVoltage = batProc.getPackVoltage(msg.data, 2, 2);
    batteryData[index - 1].packCurrent = batProc.getPackCurrent(msg.data, 4, 2);
    batteryData[index - 1].packSoc = batProc.getPackSoc(msg.data, 6, 2);
    batteryData[index - 1].updatePackCounter();
    // Serial1.println("Id : " + String(index));
    // Serial1.println("Pack Voltage : " + String(batteryData[index - 1].packVoltage));
    // Serial1.println("Pack Current : " + String(batteryData[index - 1].packCurrent));
    // Serial1.println("Pack Soc : " + String(batteryData[index - 1].packSoc));
    break;
  case MOSF_TEMP :
    baseAddr = static_cast<int>(MOSF_TEMP_ADDR);
    index = baseAddr - frameId;
    // index = abs(index);
    batteryData[index - 1].isUpdated = 1;
    batProc.updateMosfetStatus(msg.data[0], batteryData[index-1]);
    batteryData[index - 1].updateMosfetCounter();
    batteryData[index - 1].temperature.top = batProc.getTemperature(msg.data,3, 1);
    batteryData[index - 1].temperature.mid = batProc.getTemperature(msg.data,4, 1);
    batteryData[index - 1].temperature.bot = batProc.getTemperature(msg.data,5, 1);
    batteryData[index - 1].temperature.cmosTemp = batProc.getTemperature(msg.data,6, 1);
    batteryData[index - 1].temperature.dmosTemp = batProc.getTemperature(msg.data,7, 1);
    batteryData[index - 1].updateTemperatureCounter();
    // Serial1.println("Id : " + String(index - 1));
    // Serial1.println("Mosfet Status : " + String(batteryData[index - 1].mosfetStatus.val));
    // Serial1.println("Temperature Top : " + String(batteryData[index - 1].temperature.top));
    // Serial1.println("Temperature Mid : " + String(batteryData[index - 1].temperature.mid));
    // Serial1.println("Temperature Bot : " + String(batteryData[index - 1].temperature.bot));
    // Serial1.println("Temperature Cmos : " + String(batteryData[index - 1].temperature.cmosTemp));
    // Serial1.println("Temperature Dmos : " + String(batteryData[index - 1].temperature.dmosTemp));
    break;

  default:
    break;
  }

  if (frameId == 0x1D42C8E8) //ehub write lvd low config
  {
    Serial1.println("Write lvd low config");
    voltageAlarm.vsatLowVoltage = (msg.data[1] << 8) + msg.data[0];
    uint16_t temp;
    EEPROM.get(LVD_LOW_VSAT_ADDR, temp);
    if(temp != voltageAlarm.vsatLowVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_VSAT_ADDR, voltageAlarm.vsatLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.otherLowVoltage = (msg.data[3] << 8) + msg.data[2];
    EEPROM.get(LVD_LOW_OTHER_ADDR, temp);
    if(temp != voltageAlarm.otherLowVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_OTHER_ADDR, voltageAlarm.otherLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    voltageAlarm.btsLowVoltage = (msg.data[5] << 8) + msg.data[4];
    EEPROM.get(LVD_LOW_BTS_ADDR, temp);
    if(temp != voltageAlarm.btsLowVoltage)
    {
      Serial1.println("Write to EEPROM");
      EEPROM.put(LVD_LOW_BTS_ADDR, voltageAlarm.btsLowVoltage);
    }
    else
    {
      Serial1.println("Same data");
    }

    // voltageAlarm.tolerance = (msg.data[7] << 8) + msg.data[6];
    // EEPROM.get(LVD_TOLERANCE_ADDR, temp);
    // if(temp != voltageAlarm.tolerance)
    // {
    //   Serial1.println("Write to EEPROM");
    //   EEPROM.put(LVD_TOLERANCE_ADDR, voltageAlarm.tolerance);
    // }
    // else
    // {
    //   Serial1.println("Same data");
    // }

