thomsardi/stm32-lvd/src/main.cpp
void otherON()
{
  digitalWrite(ON3, HIGH);
  vTaskDelay(20);
  digitalWrite(ON3, LOW);
}

void otherOFF()
{
  digitalWrite(OFF3, HIGH);
  vTaskDelay(20);
  digitalWrite(OFF3, LOW);
}

static void relayTask(void *arg)
{
  bool btsOn = true;
  bool vsatOn = true;
  bool otherOn = true;
  bool btsOnSimState = false;
  bool vsatOnSimState = false;
  bool otherOnSimState = false;
  uint8_t timeToShow = 0;
  uint8_t receivedData;
  int32_t totalVoltage = 0;
  int32_t totalCurrent = 0;
  int32_t totalSoc = 0;
  uint8_t detectedBattery = 0;
  int32_t averageVoltage = 0;
  int32_t averageCurrent = 0;
  int32_t averageSoc = 0;
  while(1)
  {
    // Serial1.println("Relay Task");
    detectedBattery = 0;
    averageVoltage = 0;
    averageCurrent = 0;
    totalVoltage = 0;
    totalCurrent = 0;
    totalSoc = 0;
    for (size_t i = 0; i < batterySize; i++)
    {
      if (batteryData[i].isUpdated && batteryData[i].mosfetStatus.dmos) // if the value constanly updated and dmos is connected to load, count the battery
      {
        totalVoltage += batteryData[i].packVoltage;
        totalCurrent += batteryData[i].packCurrent;
        totalSoc += batteryData[i].packSoc;
        detectedBattery++;
      }
      else
      {
        continue;
      }
    }
    
    averageVoltage = totalVoltage / detectedBattery;
    averageCurrent = totalCurrent / detectedBattery;
    averageSoc = totalSoc / detectedBattery;
    if(timeToShow > 5)
    {
      Serial1.println("Detected Battery : " + String(detectedBattery));
      Serial1.println("Average Pack Voltage : " + String(averageVoltage));
      Serial1.println("Average Pack Current : " + String(averageCurrent));
      Serial1.println("Average Pack Soc : " + String(averageSoc));
      Serial1.println("Bts Voltage Alarm : " + String(voltageAlarm.btsLowVoltage));
      Serial1.println("Bts Upper Threshold : " + String(voltageAlarm.btsReconnectVoltage));
      Serial1.println("Vsat Voltage Alarm : " + String(voltageAlarm.vsatLowVoltage));
      Serial1.println("Vsat Upper Threshold : " + String(voltageAlarm.vsatReconnectVoltage));
      Serial1.println("Other Voltage Alarm : " + String(voltageAlarm.otherLowVoltage));
      Serial1.println("Other Upper Threshold : " + String(voltageAlarm.otherReconnectVoltage));
      timeToShow = 0;
    }
    
    if (keepAliveCounter.lastCnt != keepAliveCounter.cnt)
    {
      keepAliveCounter.lastCnt = keepAliveCounter.cnt;
    }
    else
    {
      lostConnectionCounter++;
    }
    
    if(lostConnectionCounter > 50)
    {
      Serial1.println("lost connection from Ehub");
      isOverriden = false;
      lostConnectionCounter = 0;
    }

    if(!isOverriden)
    {
      Serial1.println("Is Not Overriden");
      if (averageVoltage <= voltageAlarm.btsLowVoltage)
      {
        btsOn = false;
      }
      if (averageVoltage <= voltageAlarm.vsatLowVoltage)
      {
        vsatOn = false;
      }
      if (averageVoltage <= voltageAlarm.otherLowVoltage)
      {
        otherOn = false;
      }

      /**
       * @brief this check state of vsat, if this should be on, then it check for relay feedback, if it's still not connected,
       *        re - trigger relay again
       * @details when vsat should be off, it will check the feedback, if it's still connected, re - trigger relay again. the state
       *          will get flipped when the voltage reach voltage alarm + tolerance
      */
      if (vsatOn) //if vsat relay should be on
      {
        // if(!additionalCanData.relayState.vsat) //if feedback still off, re-trigger relay
        if(!vsatOnSimState) //if feedback still off, re-trigger relay
        {
          Serial1.println("===Vsat On===");
          vsatOnSimState = true;
          ehubRelay.vsat = true;
          vsatON();
        }
      }
      else //if vsat relay should be off
      {
        // if(additionalCanData.relayState.vsat) //if feedback still on, re-trigger relay
        if(vsatOnSimState) //if feedback still on, re-trigger relay
        {
          Serial1.println("===Vsat Off===");
          vsatOnSimState = false;
          ehubRelay.vsat = false;
          vsatOFF();
        }
        // if(averageVoltage >= voltageAlarm.getVsatUpperThreshold())
        if(averageVoltage >= voltageAlarm.vsatReconnectVoltage)
        {
          vsatOn = true;
        }      
        
      }
      
      if (btsOn) //if bts relay should be on
      {
        // if(!additionalCanData.relayState.bts) //if feedback still off, re-trigger relay
        if(!btsOnSimState) //if feedback still off, re-trigger relay
        {
          Serial1.println("===Bts On===");
          btsOnSimState = true;
          ehubRelay.bts = true;
          btsON();
        }      
      }
      else //if bts relay should be off
      {
        // if(additionalCanData.relayState.bts) //if feedback still on, re-trigger relay
        if(btsOnSimState) //if feedback still on, re-trigger relay
        {
          Serial1.println("===Bts Off===");
          btsOnSimState = false;
          ehubRelay.bts = false;
          btsOFF();
        }
        // if(averageVoltage >= voltageAlarm.getBtsUpperThreshold())
        if(averageVoltage >= voltageAlarm.btsReconnectVoltage)
        {
          btsOn = true;
        }      
      }

      if (otherOn) //if other relay should be on
      {
        
        // if(!additionalCanData.relayState.other) //if feedback still off, re-trigger relay
        if(!otherOnSimState) //if feedback still off, re-trigger relay
        {
          Serial1.println("===Other On===");  
          otherOnSimState = true;
          ehubRelay.other = true;
          otherON();
        }
      }
      else //if other relay should be off
      {
        //  if(additionalCanData.relayState.other) //if feedback still on, re-trigger relay
        if(otherOnSimState) //if feedback still on, re-trigger relay
        {
          Serial1.println("===Other Off===");  
          otherOnSimState = false;
          ehubRelay.other = false;
          otherOFF();
        }
        // if(averageVoltage >= voltageAlarm.getOtherUpperThreshold())
        if(averageVoltage >= voltageAlarm.otherReconnectVoltage)
        {
          otherOn = true;
        }
      }
    }
    else
    {
      Serial1.println("Overriden");
      if(ehubRelay.vsat)  // if ehub activate vsat relay
      {
        // if(!additionalCanData.relayState.vsat) //if feedback still off, re-trigger relay
        if(!vsatOnSimState)
        {
          Serial1.println("Vsat On with override");
          vsatOnSimState = true;
          vsatON();
        }
      }
      else  //if ehub deactivate vsat relay
      {
        // if(additionalCanData.relayState.vsat) //if feedback still on, re-trigger relay
        if(vsatOnSimState)
        {
          Serial1.println("Vsat off with override");
          vsatOnSimState = false;
          vsatOFF();
        }  
      }

