thomsardi/stm32-lvd/src/main.cpp
      if (ehubRelay.bts)  // if ehub activate bts relay
      {
        // if(!additionalCanData.relayState.bts) //if feedback still off, re-trigger relay
        if(!btsOnSimState)
        {
          Serial1.println("Bts on with override");
          btsOnSimState = true;
          btsON();
        }
      }
      else  //if ehub deactivate bts relay
      {
        // if(additionalCanData.relayState.bts)  //if feedback still on, re-trigger relay
        if(btsOnSimState)
        {
          Serial1.println("Bts off with override");
          btsOnSimState = false;
          btsOFF();
        }
      }
      
      if (ehubRelay.other) // if ehub activate other relay
      {
        // if(!additionalCanData.relayState.other) //if feedback still off, re-trigger relay
        if(!otherOnSimState)
        {
          Serial1.println("Other on with override");
          otherOnSimState = true;
          otherON();
        }
      }
      else  //if ehub deactivate other relay
      {
        // if(additionalCanData.relayState.other)  //if feedback still on, re-trigger relay
        if(otherOnSimState)
        {
          Serial1.println("Other off with override");
          otherOnSimState = false;
          otherOFF();
        }
      }
    }
    timeToShow++;
    vTaskDelay(200);
  }
}


static void canSenderTask(void *arg)
{
  bool isOff = true;
  CAN_msg_t msg;
  int idInc = 1;
  int totalId = sizeof(batteryData) / sizeof(batteryData[0]);
  // Serial.println("Total size = " + String(totalId));
  while(1)
  {
    if (xQueueReceive(canSenderTaskQueue, &msg, 100) == pdTRUE) 
    {
      can.send(&msg);
      // Serial1.println("Send CAN current & relay");
    }
    else
    {
      // msg to keep the battery awake
      if(idInc > totalId)
      {
        idInc = 1;
      }
      CAN_msg_t msg;
      msg.id = WAKE_ADDR + (idInc << 8);
      msg.format = CAN_FORMAT::EXTENDED_FORMAT;
      msg.type = CAN_FRAME::DATA_FRAME;
      msg.len = 8;
      msg.data[0] = 0x33;
      msg.data[1] = 0x63;
      msg.data[2] = 0x60;
      msg.data[3] = 0x64;
      msg.data[4] = 0x64;
      msg.data[5] = 0x64;
      msg.data[6] = 0x53;
      msg.data[7] = 0x64;
      can.send(&msg);
      // Serial1.println("Send CAN to wake up battery");
      // Serial1.print("Frame id : ");
      // Serial1.println(msg.id, HEX);
      // Serial1.print("Data : ");
      // for (size_t i = 0; i < 8; i++)
      // {
      //   Serial1.print(msg.data[i], HEX);
      //   Serial1.print(" ");
      // }
      // Serial.println();
      
      idInc++;
    }
    // vTaskDelay(1000);
  }
}

void ina3221Task()
{
  int limitUnderAmpere = 0.2;
  
  float current[3];
  float voltage[3];

  current[0] = -ina3221b.getCurrent(INA3221_CH3); // add - assign to negate the value
  // voltage[0] = ina3221b.getVoltage(INA3221_CH1);

  current[1] = -ina3221b.getCurrent(INA3221_CH2); // add - assign to negate the value
  // voltage[1] = ina3221b.getVoltage(INA3221_CH2);

  current[2] = -ina3221b.getCurrent(INA3221_CH1); // add - assign to negate the value
  // voltage[2] = ina3221b.getVoltage(INA3221_CH3);

  if (current[0] < limitUnderAmpere)
    current[0] = 0;
  if (current[1] < limitUnderAmpere)
    current[1] = 0;
  if (current[2] < limitUnderAmpere)
    current[2] = 0;

  // int current1bit1 = current[0];
  // int current1bit2 = (current[0] - current1bit1) * 100;

  // int current2bit1 = current[1];
  // int current2bit2 = (current[1] - current2bit1) * 100;

  // int current3bit1 = current[2];
  // int current3bit2 = (current[2] - current3bit1) * 100;

  additionalCanData.current[0] = current[0];
  additionalCanData.current[1] = current[1];
  additionalCanData.current[2] = current[2];

  // msg.data[2] = current1bit1;
  // msg.data[3] = current1bit2;
  // msg.data[4] = current2bit1;
  // msg.data[5] = current2bit2;
  // msg.data[6] = current3bit1;
  // msg.data[7] = current3bit2;
  // int dataDummy[8];
  // dataDummy[0] = 1; // standart start frame sundaya
  // dataDummy[1] = totalFo; // for relay contact on or off
  // dataDummy[2] = current1bit1;
  // dataDummy[3] = current1bit2;
  // dataDummy[4] = current2bit1;
  // dataDummy[5] = current2bit2;
  // dataDummy[6] = current3bit1;
  // dataDummy[7] = current3bit2;
  
  // sendCanbus(dataDummy);

  // Serial1.print("Channel 1: ");
  // Serial1.print(current[0], 1);
  // Serial1.println("A, ");

  // Serial1.print("Channel 2: ");
  // Serial1.print(current[1], 1);
  // Serial1.println("A, ");

  // Serial1.print("Channel 3: ");
  // Serial1.print(current[2], 1);
  // Serial1.println("A, ");

  // delay(10);
}

void setup() {
  // put your setup code here, to run once:
  // int result = myFunction(2, 3);
  pinMode(ON1, OUTPUT);
  pinMode(ON2, OUTPUT);
  pinMode(ON3, OUTPUT);
  pinMode(OFF1, OUTPUT);
  pinMode(OFF2, OUTPUT);
  pinMode(OFF3, OUTPUT);
  pinMode(FB1, INPUT);
  pinMode(FB2, INPUT);
  pinMode(FB3, INPUT);
  

  // batteryData[0].mosfetStatus.cmos = 1;
  // batteryData[0].mosfetStatus.dmos = 0;
  xTaskCreate(relayTask,
    "RelayTask",
    configMINIMAL_STACK_SIZE + 100,
    NULL,
    tskIDLE_PRIORITY + 2,
    &relayTaskHandle);

  xTaskCreate(canSenderTask,
    "canSenderTask",
    configMINIMAL_STACK_SIZE,
    // 64,
    NULL,
    tskIDLE_PRIORITY + 1,
    &canSenderTaskHandle);

  // xTaskCreate(ina3221Task,
  //   "ina3221Task",
  //   configMINIMAL_STACK_SIZE,
  //   NULL,
  //   tskIDLE_PRIORITY + 2,
  //   &ina3221TaskHandle);

  // relayTaskQueue = xQueueCreate(5, sizeof(uint8_t));
  canSenderTaskQueue = xQueueCreate(10, sizeof(CAN_msg_t));

  ina3221b.begin();
  ina3221b.reset();
  ina3221b.setShuntRes(5, 5, 5);
  Serial1.begin(115200);
  can.onReceive(canHandler);
  if(!can.init(CAN_250KBPS, 0))
  {
    Serial1.println("CAN1 initialize fail");
  }
  Serial1.println("CAN1 initialize success");
  
  uint8_t isFlagSet;
  EEPROM.get(FLAG_SET_ADDR, isFlagSet);
  uint16_t temp;
  if(isFlagSet == 1)
  {
    Serial1.println("Get existing data from EEPROM");
    
    EEPROM.get(LVD_LOW_VSAT_ADDR, temp);
    Serial1.println("lvd vsat voltage : " + String(temp));
    voltageAlarm.vsatLowVoltage = temp;
    EEPROM.get(LVD_LOW_BTS_ADDR, temp);
    Serial1.println("lvd bts voltage : " + String(temp));
    voltageAlarm.btsLowVoltage = temp;
    EEPROM.get(LVD_LOW_OTHER_ADDR, temp);
    Serial1.println("lvd other voltage : " + String(temp));
    voltageAlarm.otherLowVoltage = temp;
    EEPROM.get(LVD_TOLERANCE_ADDR, temp);
    Serial1.println("lvd tolerance : " + String(temp));
    voltageAlarm.tolerance = temp;

    EEPROM.get(LVD_RECONNECT_VSAT_ADDR, temp);
    Serial1.println("lvd vsat reconnect voltage : " + String(temp));
    voltageAlarm.vsatReconnectVoltage = temp;
    EEPROM.get(LVD_RECONNECT_BTS_ADDR, temp);
    Serial1.println("lvd bts reconnect voltage : " + String(temp));
    voltageAlarm.btsReconnectVoltage = temp;
    EEPROM.get(LVD_RECONNECT_OTHER_ADDR, temp);
    Serial1.println("lvd other reconnect voltage : " + String(temp));
    voltageAlarm.otherReconnectVoltage = temp;

    EEPROM.get(LVD_TOLERANCE_ADDR, temp);
    Serial1.println("lvd tolerance : " + String(temp));
    voltageAlarm.tolerance = temp;

    EEPROM.get(NOMINAL_BAT_ADDR, temp);
    Serial1.println("nominal bat voltage : " + String(temp));
    voltageAlarm.nominalBattery = temp;
    EEPROM.get(UNIQUE_ID_ADDR, temp);
    Serial1.println("uniqueid : " + String(temp));
    uniqueId = temp;
    EEPROM.get(FLAG_SET_ADDR, temp);
    Serial1.println("flag set : " + String(temp));
  }
  else
  {
    Serial1.println("Write new data to EEPROM");
    EEPROM.put(LVD_LOW_VSAT_ADDR, voltageAlarm.vsatLowVoltage);
    EEPROM.get(LVD_LOW_VSAT_ADDR, temp);
    Serial1.println("lvd vsat voltage : " + String(temp));
    EEPROM.put(LVD_LOW_BTS_ADDR, voltageAlarm.btsLowVoltage);
    EEPROM.get(LVD_LOW_BTS_ADDR, temp);
    Serial1.println("lvd bts voltage : " + String(temp));
    EEPROM.put(LVD_LOW_OTHER_ADDR, voltageAlarm.otherLowVoltage);
    EEPROM.get(LVD_LOW_OTHER_ADDR, temp);

    EEPROM.put(LVD_RECONNECT_VSAT_ADDR, voltageAlarm.vsatReconnectVoltage);
    EEPROM.get(LVD_RECONNECT_VSAT_ADDR, temp);
    Serial1.println("lvd vsat reconnect voltage : " + String(temp));
    EEPROM.put(LVD_RECONNECT_BTS_ADDR, voltageAlarm.btsReconnectVoltage);
    EEPROM.get(LVD_RECONNECT_BTS_ADDR, temp);
    Serial1.println("lvd bts reconnect voltage : " + String(temp));
    EEPROM.put(LVD_RECONNECT_OTHER_ADDR, voltageAlarm.otherReconnectVoltage);
    EEPROM.get(LVD_RECONNECT_OTHER_ADDR, temp);
    Serial1.println("lvd other reconnect voltage : " + String(temp));

    EEPROM.put(LVD_TOLERANCE_ADDR, voltageAlarm.tolerance);
    EEPROM.get(LVD_TOLERANCE_ADDR, temp);
    Serial1.println("lvd tolerance : " + String(temp));
    EEPROM.put(NOMINAL_BAT_ADDR, voltageAlarm.nominalBattery);
    EEPROM.get(NOMINAL_BAT_ADDR, temp);
    Serial1.println("nominal bat voltage : " + String(temp));
    EEPROM.put(UNIQUE_ID_ADDR, uniqueId);
    EEPROM.get(UNIQUE_ID_ADDR, temp);
    Serial1.println("uniqueid : " + String(temp));
    EEPROM.put(FLAG_SET_ADDR, 1);
    EEPROM.get(FLAG_SET_ADDR, isFlagSet);
    Serial1.println("flag set : " + String(isFlagSet));
  }

  // uint32_t bank1, bank2;
  // bank1 = 0x12345678 << 3;
  // bank1 = bank1 + 0x04; // Ext
  // bank2 = 0xFFFFFFFC; // Must be IDE=1
  // can.setFilter(0, 1, 0, 0, bank1, bank2);
  // can.setFilter(0, 1, 0, 0, 0x02, 0x1FFFFFFF);
  FilterConfig filterConfig = {
    .idConfig = {
      // .id = 0x760C840,
      .id = 0x540C840,
      .ideMode = FilterConfig::CanFormatAcceptanceMode::EXTENDED_FORMAT,
      .rtrMode = FilterConfig::CanFrameAcceptanceMode::DATA_FRAME
    },
    .maskConfig = {
      // .mask = 0xFF8FFC0,
      .mask = 0x5D8FF40,
      .ideCheck = FilterConfig::IdeCheck::IDE_UNCHECKED,
      .rtrCheck = FilterConfig::RtrCheck::RTR_UNCHECKED,
    }
  };
  bool result = can.filter(filterConfig);
  if(result)
  {
    Serial1.println("Success set filter");
  }
  else
  {
    Serial1.println("Failed to set filter");
  }
  vTaskStartScheduler();
}

void loop() {
  can.loop();
  
  additionalCanData.relayState.vsat = digitalRead(FB1);
  additionalCanData.relayState.bts = digitalRead(FB2);
  additionalCanData.relayState.other = digitalRead(FB3);

  // Serial1.println("Vsat Status : " + String(additionalCanData.relayState.vsat));
  // Serial1.println("Bts Status : " + String(additionalCanData.relayState.bts));
  // Serial1.println("Other Status : " + String(additionalCanData.relayState.other));

  if(millis() - lastCheckTime > 5000)
  {
    for (size_t i = 0; i < batterySize; i++)
    {
      if (batteryData[i].isUpdated)
      {
        if(batteryData[i].cnt.previousPackUpdatedCounter == batteryData[i].cnt.packUpdatedCounter)
        {
          batteryData[i].isUpdated = 0;
        }
      }
    }
    lastCheckTime = millis();
  }

  if (millis() - lastTime > 1000)
  {
    ina3221Task();
    Serial1.println("Vsat Relay State : " + String(additionalCanData.relayState.vsat));
    Serial1.println("Bts Relay State : " + String(additionalCanData.relayState.bts));
    Serial1.println("Other Relay State : " + String(additionalCanData.relayState.other));

    lastTime = millis();

    int current1bit1 = additionalCanData.current[0];
    int current1bit2 = (additionalCanData.current[0] - current1bit1) * 100;

    int current2bit1 = additionalCanData.current[1];
    int current2bit2 = (additionalCanData.current[1] - current2bit1) * 100;

    int current3bit1 = additionalCanData.current[2];
    int current3bit2 = (additionalCanData.current[2] - current3bit1) * 100;

    CAN_msg_t msg;
    msg.id = 0x1D40C8E7;
    msg.format = CAN_FORMAT::EXTENDED_FORMAT;
    msg.type = CAN_FRAME::DATA_FRAME;
    msg.len = 8;
    msg.data[0] = 1;
    msg.data[1] = additionalCanData.relayState.val; // for relay contact on or off
    msg.data[2] = current1bit1;
    msg.data[3] = current1bit2;
    msg.data[4] = current2bit1;
    msg.data[5] = current2bit2;
    msg.data[6] = current3bit1;
    msg.data[7] = current3bit2;
    xQueueSend(canSenderTaskQueue, &msg, portMAX_DELAY);
  }

}

// put function definitions here:
int myFunction(int x, int y) {
  return x + y;
}